# Задача «Длина слова»

a="моноколесо"
print(len(a))

# Задача «Суммы и разности»

first=5
second=15

summa=first+second
diff=first-second
print(summa,diff)

# Задача «Среднее арифметическое»

first=5
second=15
third=25
mean=(first+second+third)/3
print(mean)

# Задача «Простые строчки»

first_string="Вторник"
second_string="Понедельник"
print(second_string+", "+first_string)

# Задача «Сложная формула»

a=2
b=4
c=8
f=(a*b)+(a*c)
print((f**3)/2)